
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Строка из Товары Цикл
		
		НовДвижение = Движения.ТоварНаСкладе.Добавить();
		НовДвижение.Номенклатура = Строка.Номенклатура;
		НовДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
		НовДвижение.Регистратор = Ссылка;
		НовДвижение.Период = ТекущаяДата();
			
	КонецЦикла;
	
	
	
	Движения.ТоварНаСкладе.Записывать = Истина;
	Движения.ТоварНаСкладе.БлокироватьДляИзменения = Истина;	
	Движения.Записать();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварНаСкладе.Остатки КАК ТоварНаСкладеОстатки";
	Выб = Запрос.Выполнить().Выбрать();
	Пока  Выб.Следующий() Цикл
	КонецЦикла;
	
	
КонецПроцедуры
