
Функция testservicenom(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаТоваров = ПолучитьСписокТовара();
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	Ответ.УстановитьТелоИзСтроки(СтрокаТоваров, КодировкаТекста.UTF8);
	Возврат Ответ;
КонецФункции


Функция ПолучитьСписокТовара()
	
	МассивТОваров = Новый Массив();
	Выб = Справочники.Номенклатура.Выбрать();
	Пока Выб.Следующий() Цикл
		Товар = Новый Структура("name", Выб.Наименование);		
		МассивТОваров.Добавить(Товар);	
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивТОваров); 
	Строка = ЗаписьJSON.Закрыть();
	Возврат Строка;
	
КонецФункции
